# Point Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PointLoad..::..Point Property
PointLoad Class See Also
---
Returns the position of point load, measured in decimal feet.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public XYZ Point { get; set; }
```

Visual Basic
---
```text
Public Property Point As XYZ
	Get
	Set
```

Visual C++
---
```text
public:
property XYZ^ Point {
	XYZ^ get ();
	void set (XYZ^ value);
}
```

# Remarks
Loacation can be set only for hosted loads. This method works for loads which are not constrained to their host. To determine if load is hosted use IsHosted property.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | When setting this property: This PointLoad is not a hosted load. -or- When setting this property: This PointLoad is a constrained load. |

# See Also
PointLoad Class
Autodesk.Revit.DB.Structure Namespace